[
    {
        "Name": "Troll", 
        "Text": "A troll is a being in Nordic folklore, including Norse mythology. In Old Norse sources, beings described as trolls dwell in isolated areas of rocks, mountains, or caves, live together in small family units, and are rarely helpful to human beings.\nIn later Scandinavian folklore, trolls became beings in their own right, where they live far from human habitation, are not Christianized, and are considered dangerous to human beings. Depending on the source, their appearance varies greatly; trolls may be ugly and slow-witted, or look and behave exactly like human beings, with no particularly grotesque characteristic about them.\nTrolls are sometimes associated with particular landmarks in Scandinavian folklore, which at times may be explained as formed from a troll exposed to sunlight. Trolls are depicted in a variety of media in modern popular culture.\nLater in Scandinavian folklore, trolls become defined as a particular type of being. Numerous tales are recorded about trolls in which they are frequently described as being extremely old, very strong, but slow and dim-witted, and are at times described as man-eaters and as turning to stone upon contact with sunlight. However, trolls are also attested as looking much the same as human beings, without any particularly hideous appearance about them, but living far away from human habitation and generally having 'some form of social organization'—unlike the rå and näck, who are attested as 'solitary beings'. According to John Lindow, what sets them apart is that they are not Christian, and those who encounter them do not know them. Therefore, trolls were in the end dangerous, regardless of how well they might get along with Christian society, and trolls display a habit of bergtagning ('kidnapping'; literally 'mountain-taking') and overrunning a farm or estate.\nLindow states that the etymology of the word 'troll' remains uncertain, though he defines trolls in later Swedish folklore as 'nature beings' and as 'all-purpose otherworldly being[s], equivalent, for example, to fairies in Anglo-Celtic traditions'. They 'therefore appear in various migratory legends where collective nature-beings are called for'. Lindow notes that trolls are sometimes swapped out for cats and 'little people' in the folklore record.\nA Scandinavian folk belief that lightning frightens away trolls and jötnar appears in numerous Scandinavian folktales, and may be a late reflection of the god Thor's role in fighting such beings. In connection, the lack of trolls and jötnar in modern Scandinavia is sometimes explained as a result of the 'accuracy and efficiency of the lightning strokes'. Additionally, the absence of trolls in regions of Scandinavia is described in folklore as being a 'consequence of the constant din of the church-bells'. This ringing caused the trolls to leave for other lands, although not without some resistance; numerous traditions relate how trolls destroyed a church under construction or hurled boulders and stones at completed churches. Large local stones are sometimes described as the product of a troll's toss. Additionally, into the 20th century, the origins of particular Scandinavian landmarks, such as particular stones, are ascribed to trolls who may, for example, have turned to stone upon exposure to sunlight.\nLindow compares the trolls of the Swedish folk tradition to Grendel, the supernatural mead hall invader in the Old English poem Beowulf, and notes that 'just as the poem Beowulf emphasizes not the harrying of Grendel but the cleansing of the hall of Beowulf, so the modern tales stress the moment when the trolls are driven off.'\nSmaller trolls are attested as living in burial mounds and in mountains in Scandinavian folk tradition. In Denmark, these creatures are recorded as troldfolk ('troll-folk'), bjergtrolde ('mountain-trolls'), or bjergfolk ('mountain-folk') and in Norway also as troldfolk ('troll-folk') and tusser. Trolls may be described as small, human-like beings or as tall as men depending on the region of origin of the story.\nIn Norwegian tradition, similar tales may be told about the larger trolls and the Huldrefolk ('hidden-folk'), yet a distinction is made between the two. The use of the word trow in Orkney and Shetland, to mean beings which are very like the Huldrefolk in Norway, may suggest a common origin for the terms. The word troll may have been used by pagan Norse settlers in Orkney and Shetland as a collective term for supernatural beings who should be respected and avoided rather than worshipped. Troll could later have become specialized as a description of the larger, more menacing Jötunn-kind whereas Huldrefolk may have developed as the term for smaller trolls.\nJohn Arnott MacCulloch posited a connection between the Old Norse vættir and trolls, suggesting that both concepts may derive from spirits of the dead.\nTroll, a Norwegian research station in Antarctica, is so named because of the rugged mountains which stand around that place like trolls. It includes a ground station which tracks satellites in polar orbit.",
        "ImageLarge": "largeLink",
        "ImageSmall": "smallLink",
        "ImageMedium": "troll.jpg"
    },
    {
        "Name": "Gårdstomte",
        "TextTop": "A nisse (Danish: [ˈne̝sə], Norwegian: [ˈnɪ̂sːə]), tomte (Swedish: [ˈtɔ̂mːtɛ]), tomtenisse, or tonttu (Finnish: [ˈtontːu]) is a mythological creature from Nordic folklore today typically associated with the winter solstice and the Christmas season. They are generally described as being short, having a long white beard, and wearing a conical or knit cap in gray, red or some other bright colour. They often have an appearance somewhat similar to that of a garden gnome.\nThe nisse is one of the most familiar creatures of Scandinavian folklore, and he has appeared in many works of Scandinavian literature. With the romanticisation and collection of folklore during the 19th century, the nisse gained popularity.\n According to tradition, the nisse lives in the houses and barns of the farmstead, and secretly acts as their guardian.  If treated well, they protect the family and animals from evil and misfortune, and may also aid the chores and farm work.  However, they are known to be short tempered, especially when offended. Once insulted, they will usually play tricks, steal items and even maim or kill livestock.\nThe nisse/tomte was often imagined as a small, elderly man (size varies from a few inches to about half the height of an adult man), often with a full beard; dressed in the traditional farmer garb, consisting of a pull-over woolen tunic belted at the waist and knee breeches with stockings. This was still the common male dress in rural Scandinavia in the 17th century, giving an indication of when the idea of the nisse spread. However, there are also folktales where he is believed to be a shapeshifter able to take a shape far larger than an adult man, and other tales where the nisse is believed to have a single, Cyclopean eye. In modern Denmark, nisser are often seen as beardless, wearing grey and red woolens with a red cap. Since nisser are thought to be skilled in illusions and sometimes able to make themselves invisible, one was unlikely to get more than brief glimpses of him no matter what he looked like. Norwegian folklore states that he has four fingers, and sometimes with pointed ears and eyes reflecting light in the dark, like those of a cat.\nHeight\nThe tomte's height is anywhere from 60 cm (2 ft) to no taller than 90 cm (3 ft) according to one Swedish-American source, whereas the tomte (pl. tomtarna) were just 1 aln tall (an aln or Swedish ell being just shy of 60 cm or 2 ft), according to one local Swedish tradition.",
        "TextMid": "Despite his small size, nisse possess immense strength. They are easily offended by carelessness, lack of proper respect, and lazy farmers. As the protector of the farm and caretaker of livestock, their retributions for bad practices range from small pranks like a hard strike to the ear to more severe punishment like killing of livestock or ruining of the farm's fortune. Observance of traditions is thought to be important to the nisse, as they do not like changes in the way things are done at their farms. They are also easily offended by rudeness; farm workers swearing, urinating in the barns, or not treating the creatures well can frequently lead to a sound thrashing by the tomte/nisse. If anyone spills something on the floor in the nisse‘s house, it is considered proper to shout a warning to the tomte below.\nOne is also expected to please nisse with gifts (see Blót) – a traditional gift is a bowl of porridge on Christmas Eve. If the tomte is not given his gift, he might leave the farm or house or engage in mischief such as tying the cows' tails together in the barn, turning objects upside-down, and breaking things (like a troll). The nisse likes his porridge with a pat of butter on the top. In an often retold story, a farmer put the butter underneath the porridge. When the nisse of his farmstead found that the butter was missing, he was filled with rage and killed the cow resting in the barn. But, as he thus became hungry, he went back to his porridge (ricepudding) and ate it, and so found the butter at the bottom of the bowl. Full of grief, he then hurried to search the lands to find another farmer with an identical cow, and replaced the former with the latter. In another tale a Norwegian maid decided to eat the porridge herself, and ended up severely beaten by the nisse. The being swore: 'Have you eaten the porridge for the nisse, you have to dance with him!'. The farmer found her nearly lifeless the morning after.\nThe nisse is connected to farm animals in general, but his most treasured animal is the horse. Belief has it that one could see which horse was the tomte's favourite as it will be especially healthy and well taken care of. Sometimes the tomte will even braid its hair and tail. Undoing these braids without permission can mean misfortune or angering the tomte. Some stories tell how the nisse could drive people mad or bite them. The bite from a nisse is poisonous, and otherworldly healing is usually required. As the story goes, a girl who was bitten withered and died before help arrived.\nAn angry tomte is featured in the popular children's book by Swedish author Selma Lagerlöf, Nils Holgerssons underbara resa genom Sverige (The Wonderful Adventures of Nils). The tomte turns the naughty boy Nils into a pixie in the beginning of the book, and Nils then travels across Sweden on the back of a goose.",
        "ImageLarge": "largetomte.jpg",
        "ImageSmall": "horsetomte.jfif",
        "ImageMedium": "tomtekatt.jfif",
        "ImageBottom": "bottomtomte.jpg"
    },
    {

    }
    
]